{
  "_name_or_path": "nvidia/segformer-b0-finetuned-cityscapes-512-1024",
  "architectures": [
    "SegformerForSemanticSegmentation"
  ],
  "attention_probs_dropout_prob": 0.0,
  "classifier_dropout_prob": 0.1,
  "decoder_hidden_size": 256,
  "depths": [
    2,
    2,
    2,
    2
  ],
  "drop_path_rate": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_sizes": [
    32,
    64,
    160,
    256
  ],
  "id2label": {
    "0": "flat",
    "1": "human",
    "2": "vehicle",
    "3": "construction",
    "4": "object",
    "5": "nature",
    "6": "sky",
    "7": "void"
  },
  "image_size": [
    512,
    1024
  ],
  "initializer_range": 0.02,
  "label2id": {
    "construction": 3,
    "flat": 0,
    "human": 1,
    "nature": 5,
    "object": 4,
    "sky": 6,
    "vehicle": 2,
    "void": 7
  },
  "layer_norm_eps": 1e-06,
  "mlp_ratios": [
    4,
    4,
    4,
    4
  ],
  "model_type": "segformer",
  "num_attention_heads": [
    1,
    2,
    5,
    8
  ],
  "num_channels": 3,
  "num_encoder_blocks": 4,
  "patch_sizes": [
    7,
    3,
    3,
    3
  ],
  "reshape_last_stage": true,
  "semantic_loss_ignore_index": 255,
  "sr_ratios": [
    8,
    4,
    2,
    1
  ],
  "strides": [
    4,
    2,
    2,
    2
  ],
  "transformers_version": "4.48.0"
}
